Конфигурация отчетов/Documents/ФискальнаяПродажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФискальнаяПродажа</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРРО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассовоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФН_Чека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипРассчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СодержимоеЧека</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УКТЗЕТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/ФискальнаяПродажа/Ext/ManagerModule.bsl
Функция ПодготовкаТЗПоФОПам(ИсходнаяТЗ) Экспорт
 
	Результат = Новый Соответствие;
	 
	// Получаем уникальные ФОП, у которых включен фискальный режим
	УникальныеФОП = Новый Массив;
	Для Каждого Строка Из ИсходнаяТЗ Цикл
		Если Строка.ФОП.ФискальныйРежим Тогда
        	Если УникальныеФОП.Найти(Строка.ФОП) = Неопределено Тогда
	  			УникальныеФОП.Добавить(Строка.ФОП);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	 
	// Для каждого ФОП создаём ТЗ
	Для Каждого ФОП Из УникальныеФОП Цикл
		
		НоваяТЗ = Новый ТаблицаЗначений;
		НоваяТЗ.Колонки.Добавить("Номенклатура");
		НоваяТЗ.Колонки.Добавить("УКТЗЕД");
		НоваяТЗ.Колонки.Добавить("НалоговаяГруппа");
		НоваяТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		НоваяТЗ.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
		НоваяТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));       
		
		Для Каждого Строка Из ИсходнаяТЗ Цикл
			Если Строка.ФОП = ФОП Тогда
				НоваяСтрока = НоваяТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,УКТЗЕД,НалоговаяГруппа,Количество,Цена,Сумма");
			КонецЕсли;
		КонецЦикла;
  
  		Результат.Вставить(ФОП, НоваяТЗ);
	  
	 КонецЦикла;
	 
	 Возврат Результат;
 
КонецФункции


Функция СоздатьДокуменФискальнойПродажи(ТЗ_СодержимоеЧека, ФОП, ТипОплаты) Экспорт 

	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ТЗ_СодержимоеЧека, "ТаблицаЗначений") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТЗ_СодержимоеЧека.Количество()=0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ФОП, "СправочникСсылка.Организации") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ТипОплаты, "ПеречислениеСсылка.ТипРассчетов") Тогда
		Возврат Неопределено;
	КонецЕсли;      
	
	Док = Документы.ФискальнаяПродажа.СоздатьДокумент();
	Док.Дата      = ТекущаяДата();
	Док.ФОП       = ФОП;
	Док.ПРРО      = ФОП.ФН_ПРРО;
	Док.ТипОплаты = ТипОплаты;
	
	Для Каждого Данные Из ТЗ_СодержимоеЧека Цикл
		
		НоваяСтрока = Док.СодержимоеЧека.Добавить();
		НоваяСтрока.Код             = Данные.Номенклатура.Код;
		НоваяСтрока.Номенклатура    = Данные.Номенклатура;
		НоваяСтрока.НалоговаяГруппа = Данные.НалоговаяГруппа;
		НоваяСтрока.Количество      = Данные.Количество;
		НоваяСтрока.Цена            = Данные.Цена;
		НоваяСтрока.Сумма           = Данные.Сумма;
		НоваяСтрока.УКТЗЕТ          = Данные.УКТЗЕД;

	КонецЦикла;   
	Док.СуммаЧека = Док.СодержимоеЧека.Итог("Сумма");

	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось провести документ фискальной продажи по причине " + ОписаниеОшибки();
		Сообщение.Сообщить();  
	КонецПопытки;
	
КонецФункции // СоздатьДокуменФискальнойПродажи()
